stm32duino/Arduino_Core_STM32/boards.txt
Sparky.menu.opt.osstd=Smallest (-Os default)
Sparky.menu.opt.oslto=Smallest (-Os) with LTO
Sparky.menu.opt.oslto.build.flags.optimize=-Os -flto
Sparky.menu.opt.o1std=Fast (-O1)
Sparky.menu.opt.o1std.build.flags.optimize=-O1
Sparky.menu.opt.o1lto=Fast (-O1) with LTO
Sparky.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Sparky.menu.opt.o2std=Faster (-O2)
Sparky.menu.opt.o2std.build.flags.optimize=-O2
Sparky.menu.opt.o2lto=Faster (-O2) with LTO
Sparky.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Sparky.menu.opt.o3std=Fastest (-O3)
Sparky.menu.opt.o3std.build.flags.optimize=-O3
Sparky.menu.opt.o3lto=Fastest (-O3) with LTO
Sparky.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Sparky.menu.opt.ogstd=Debug (-g)
Sparky.menu.opt.ogstd.build.flags.optimize=-g -Og

RAK.menu.opt.osstd=Smallest (-Os default)
RAK.menu.opt.oslto=Smallest (-Os) with LTO
RAK.menu.opt.oslto.build.flags.optimize=-Os -flto
RAK.menu.opt.o1std=Fast (-O1)
RAK.menu.opt.o1std.build.flags.optimize=-O1
RAK.menu.opt.o1lto=Fast (-O1) with LTO
RAK.menu.opt.o1lto.build.flags.optimize=-O1 -flto
RAK.menu.opt.o2std=Faster (-O2)
RAK.menu.opt.o2std.build.flags.optimize=-O2
RAK.menu.opt.o2lto=Faster (-O2) with LTO
RAK.menu.opt.o2lto.build.flags.optimize=-O2 -flto
RAK.menu.opt.o3std=Fastest (-O3)
RAK.menu.opt.o3std.build.flags.optimize=-O3
RAK.menu.opt.o3lto=Fastest (-O3) with LTO
RAK.menu.opt.o3lto.build.flags.optimize=-O3 -flto
RAK.menu.opt.ogstd=Debug (-g)
RAK.menu.opt.ogstd.build.flags.optimize=-g -Og

3dprinter.menu.opt.osstd=Smallest (-Os default)
3dprinter.menu.opt.oslto=Smallest (-Os) with LTO
3dprinter.menu.opt.oslto.build.flags.optimize=-Os -flto
3dprinter.menu.opt.o1std=Fast (-O1)
3dprinter.menu.opt.o1std.build.flags.optimize=-O1
3dprinter.menu.opt.o1lto=Fast (-O1) with LTO
3dprinter.menu.opt.o1lto.build.flags.optimize=-O1 -flto
3dprinter.menu.opt.o2std=Faster (-O2)
3dprinter.menu.opt.o2std.build.flags.optimize=-O2
3dprinter.menu.opt.o2lto=Faster (-O2) with LTO
3dprinter.menu.opt.o2lto.build.flags.optimize=-O2 -flto
3dprinter.menu.opt.o3std=Fastest (-O3)
3dprinter.menu.opt.o3std.build.flags.optimize=-O3
3dprinter.menu.opt.o3lto=Fastest (-O3) with LTO
3dprinter.menu.opt.o3lto.build.flags.optimize=-O3 -flto
3dprinter.menu.opt.ogstd=Debug (-g)
3dprinter.menu.opt.ogstd.build.flags.optimize=-g -Og

Genericflight.menu.opt.osstd=Smallest (-Os default)
Genericflight.menu.opt.oslto=Smallest (-Os) with LTO
Genericflight.menu.opt.oslto.build.flags.optimize=-Os -flto
Genericflight.menu.opt.o1std=Fast (-O1)
Genericflight.menu.opt.o1std.build.flags.optimize=-O1
Genericflight.menu.opt.o1lto=Fast (-O1) with LTO
Genericflight.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Genericflight.menu.opt.o2std=Faster (-O2)
Genericflight.menu.opt.o2std.build.flags.optimize=-O2
Genericflight.menu.opt.o2lto=Faster (-O2) with LTO
Genericflight.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Genericflight.menu.opt.o3std=Fastest (-O3)
Genericflight.menu.opt.o3std.build.flags.optimize=-O3
Genericflight.menu.opt.o3lto=Fastest (-O3) with LTO
Genericflight.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Genericflight.menu.opt.ogstd=Debug (-g)
Genericflight.menu.opt.ogstd.build.flags.optimize=-g -Og

Midatronics.menu.opt.osstd=Smallest (-Os default)
Midatronics.menu.opt.oslto=Smallest (-Os) with LTO
Midatronics.menu.opt.oslto.build.flags.optimize=-Os -flto
Midatronics.menu.opt.o1std=Fast (-O1)
Midatronics.menu.opt.o1std.build.flags.optimize=-O1
Midatronics.menu.opt.o1lto=Fast (-O1) with LTO
Midatronics.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Midatronics.menu.opt.o2std=Faster (-O2)
Midatronics.menu.opt.o2std.build.flags.optimize=-O2
Midatronics.menu.opt.o2lto=Faster (-O2) with LTO
Midatronics.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Midatronics.menu.opt.o3std=Fastest (-O3)
Midatronics.menu.opt.o3std.build.flags.optimize=-O3
Midatronics.menu.opt.o3lto=Fastest (-O3) with LTO
Midatronics.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Midatronics.menu.opt.ogstd=Debug (-g)
Midatronics.menu.opt.ogstd.build.flags.optimize=-g -Og

# C Runtime Library
Nucleo_144.menu.rtlib.nano=Newlib Nano (default)
Nucleo_144.menu.rtlib.nanofp=Newlib Nano + Float Printf
Nucleo_144.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Nucleo_144.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Nucleo_144.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Nucleo_144.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Nucleo_144.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Nucleo_144.menu.rtlib.full=Newlib Standard
Nucleo_144.menu.rtlib.full.build.flags.ldspecs=

Nucleo_64.menu.rtlib.nano=Newlib Nano (default)
Nucleo_64.menu.rtlib.nanofp=Newlib Nano + Float Printf
Nucleo_64.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Nucleo_64.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Nucleo_64.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Nucleo_64.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Nucleo_64.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Nucleo_64.menu.rtlib.full=Newlib Standard
Nucleo_64.menu.rtlib.full.build.flags.ldspecs=

Nucleo_32.menu.rtlib.nano=Newlib Nano (default)
Nucleo_32.menu.rtlib.nanofp=Newlib Nano + Float Printf
Nucleo_32.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Nucleo_32.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Nucleo_32.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Nucleo_32.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Nucleo_32.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Nucleo_32.menu.rtlib.full=Newlib Standard
Nucleo_32.menu.rtlib.full.build.flags.ldspecs=

Disco.menu.rtlib.nano=Newlib Nano (default)
Disco.menu.rtlib.nanofp=Newlib Nano + Float Printf
Disco.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Disco.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Disco.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Disco.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Disco.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Disco.menu.rtlib.full=Newlib Standard
Disco.menu.rtlib.full.build.flags.ldspecs=

Eval.menu.rtlib.nano=Newlib Nano (default)
Eval.menu.rtlib.nanofp=Newlib Nano + Float Printf
Eval.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Eval.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Eval.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Eval.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Eval.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Eval.menu.rtlib.full=Newlib Standard
Eval.menu.rtlib.full.build.flags.ldspecs=

